// Задача 54: Задайте двумерный массив. Напишите программу, которая упорядочит по убыванию элементы каждой строки двумерного массива.
// Например, задан массив:
// 1 4 7 2
// 5 9 2 3
// 8 4 2 4
// В итоге получается вот такой массив:
// 7 4 2 1
// 9 5 3 2
// 8 4 4 2

int[,] matrix = new int[4, 5];

// Метод вывода двумерного массива

void PrintMatrix(int[,] matr)
{
  for (int i = 0; i < matr.GetLength(0); i++)
  {
    for (int j = 0; j < matr.GetLength(1); j++)
    {
      Console.Write($"{matr[i, j]}  \t");
    }
    Console.WriteLine();
  }
}

// Метод заполнения двумерного массива

void FillMatrix(int[,] matr, int start, int end)
{
  for (int i = 0; i < matr.GetLength(0); i++)
  {
    for (int j = 0; j < matr.GetLength(1); j++)
    {
      matr[i, j] = new Random().Next(start, end + 1);
    }
  }
}

// Метод упорядочивания элементов масива

void SortArray(int[,] array)
{
  for (int i = 0; i < array.GetLength(0); i++)
  {
    int sort = 0;
    for (int j = 0; j < array.GetLength(1) - 1; j++)
    {
      for (int k = 0; k < array.GetLength(1) - sort - 1; k++)
      {
        if (array[i, k] < array[i, k + 1])
                {
                    int temp = array[i, k + 1];
                    array[i, k + 1] = array[i, k];
                    array[i, k] = temp;
                }
      }
      sort++;
    }
  }
}

FillMatrix(matrix, 1, 10);
PrintMatrix(matrix);
Console.WriteLine();
SortArray(matrix);
PrintMatrix(matrix);